In [2]:
import pandas as pd

# Read input

In [3]:
df = pd.read_csv("input.csv", header=None, sep="   ")
df.head()

C:\Users\arnod\AppData\Local\Temp\ipykernel_13480\2928379119.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df = pd.read_csv("input.csv", header=None, sep="   ")

       0      1
0  76309  75213
1  79731  28444
2  29583  71339
3  60992  99148
4  34680  74530

In [4]:
column_1 = df[0].sort_values().reset_index(drop=True)
column_2 = df[1].sort_values().reset_index(drop=True)

combined_df = pd.DataFrame({'column_1': column_1, 'column_2': column_2})

combined_df.head()

   column_1  column_2
0     10032     10033
1     10588     10066
2     10590     10322
3     10841     10341
4     10870     10581

## Part 1

In [5]:
combined_df['diff'] = abs(column_1-column_2)
combined_df.head()

   column_1  column_2  diff
0     10032     10033     1
1     10588     10066   522
2     10590     10322   268
3     10841     10341   500
4     10870     10581   289

In [6]:
combined_df['diff'].sum()

np.int64(1110981)

## Part 2

In [9]:
value_counts = combined_df['column_2'].value_counts()
value_counts.head()

column_2
19763    20
22498    20
38056    19
81076    18
75256    18
Name: count, dtype: int64

In [ ]:

combined_df['occurances_in_column_2'] = combined_df['column_1'].apply(lambda x: value_counts[x])
combined_df.head()